[
    {
        "id": 1,
        "title": "National Science Day Presentation Competition",
        "date": "February 28, 2024",
        "content": "DICE organized a presentation competition on indigenous technologies, promoting innovation and scientific curiosity among students. 66 presentations showcased creative ideas, enhancing research skills and communication abilities.",
        "imageUrl": "/assets/blog1.jpeg"
    },
    {
        "id": 2,
        "title": "Arduino and IoT Workshop",
        "date": "February 3, 2024",
        "content": "DICE organized a workshop focusing on Arduino and IoT, led by Dr. Rajneesh Talwar and Dr. Manvinder Sharma. Students gained hands-on experience in coding, implementing LED circuits, traffic lights, and more, fostering innovation in engineering.",
        "imageUrl": "/assets/blog2.jpeg"
    },
    {
        "id": 3,
        "title": "DICE-SKOAR Gamers Arcade",
        "date": "December 8-12, 2023",
        "content": "Organized the 'DICE-SKOAR Gamers Arcade'. Over 500 students participated, experiencing AR/VR gaming, PS5, and laptop gaming. The event showcased how gaming technologies enhance learning and offered online gaming competitions with cash prizes.",
        "imageUrl": "/assets/blog3.jpeg"
    },
    {
        "id": 4,
        "title": "International Conference",
        "date": "Two-day event",
        "content": "Dr. Rajneesh Talwar's project paper on 'E-Bike' was selected at the International Conference, organized by DST-Centre, Panjab University, RFRF, FPTU-Vietnam, NTU-UK, and CICU. The conference facilitated discussions on practical knowledge opportunities, and funding initiatives, aiming to foster innovation and collaboration between industry, and government bodies.",
        "imageUrl": "/assets/blog4.jpeg"
    },
    {
        "id": 5,
        "title": "Expert Talk on Data Structures",
        "date": "August 4, 2023",
        "content": "DICE organized an Expert Talk on Data Structures at Plato Hall. Dr. Rajneesh Talwar introduced the session, followed by Dr. Sandeep Sachdeva's informative talk covering types, applications, time complexity, optimization, and live coding demonstrations.",
        "imageUrl": "/assets/blog5.jpeg"
    },
    {
        "id": 6,
        "title": "Innovation in Computer Vision Techniques",
        "date": "2025-02-27",
        "content": "Chitkara University's DICE department hosted a hands-on workshop on \"Innovation in Computer Vision Techniques\" to bridge academia and industry. Dr. Rajneesh Talwar emphasized computer vision’s significance in various industries. Industry expert Mr. Sarabjit Singh introduced key concepts like image processing and object detection. His team led practical sessions.",
        "imageUrl": "/assets/events/2025-02-27-Innovations-in-Computer-Vision-Techniques.jpg"
    }
]