[
    {
        "title": "MachAuto Expo Visit",
        "date": "2025-02-22",
        "content": "Department of Interdisciplinary Courses in Engineering (DICE) organized an educational trip to Machautoexpo 2025 at Ludhiana on 22-02-2025. The visit aimed at exposing students to the latest advancements in engineering, manufacturing, and automation technologies. Dr. Rajneesh Talwar, Professor and Dean of DICE, along with students from various engineering branches, participated in the visit, making it an enriching learning experience. Machautoexpo 2025 showcased a wide range of emerging technologies, including Robotics, Automation, Industrial IoT (IIoT), Advance Manufacturing Technologies and 3D printing.",
        "image_url": "/assets/national_events/2025-02-22-machauto-expo.jpg"
    },
    {
        "title": "DICE Team at IIT Mandi",
        "date": "2025-03-31",
        "content": "From Drones to Debugging: Chitkara Students Make a Mark at IIT Mandi Students from Chitkara University’s Department of Interdisciplinary Courses in Engineering (DICE) guided by Dr.Rajneesh Talwar, showcased their talent at XPECTO 2025—the annual tech fest at IIT Mandi, held from March 28–31. Competing alongside top institutions like IIT Mandi, DTU, PEC, IIT Delhi, and more, our students participated in high-impact events such as Domination, Wall Maze Solver, Sky Quest R-1 & R-2, Samsaya, Dementia, and Frost Hack.",
        "image_url": "/assets/national_events/2025-03-31-iit-mandi.jpg"
    },
    {
        "title": "Chitkara University Secures Prestigious Funding for AI-Smart Farming Project",
        "date": "2024-01-01",
        "content": "The Department of Interdisciplinary Courses in Engineering (DICE), Chitkara University, has achieved a significant milestone with its project, \"AI-Smart Farming using IoT and GIS,\" receiving esteemed funding from Indian Institute of Technology, Ropar. Among numerous submissions from across India, the project was recognised as one of the top four. The distinguished honour was conferred at IIT Ropar upon Dr. Rajneesh Talwar, Dean, and Dr. Manvinder Sharma, Associate Professor, DICE, in the presence of Dr. Madhu Chitkara, Pro-Chancellor, Chitkara University. The award was presented by Keshav Hingonia, IAS, Punjab, and Dr. Jatinder Kaur Arora, Former Executive Director, PSCST.",
        "image_url": "/assets/iit_ropar_ai_smart_farming.jpg"
    },
    {
        "title": "Chitkara University Represents Punjab at Bharatiya Vigyan Sammelan 2023",
        "date": "2023-12-21",
        "content": "From December 21 to 24, 2023, the 6th Bharatiya Vigyan Sammelan and Expo, jointly organized by Vijnana Bharati and the Government of Gujarat, took place in Ahmedabad. Dr. Rajneesh Talwar, Dean of the Department of Interdisciplinary Courses in Engineering (DICE) at Chitkara University, was invited as a judge and represented both the university and the state of Punjab as the 'State Coordinator'. At the event, Dr. Talwar shared his valuable insights with participants, thought leaders, and organizers. The Bharatiya Vigyan Sammelan showcased a diverse range of activities, including a themed conference, a science exhibition, and interactive sessions with scientists from India and abroad. BVS 2023 aimed to provide an excellent platform for integrating and showcasing Indian traditional practices, grassroots innovations, and contributions of common people in science, alongside the scientific contributions of researchers and scientists in contemporary science. The event welcomed scientists, researchers, academicians, technocrats, grassroots innovators, farmers, artisans, and students to share their research, scientific innovations, and creative ideas aimed at providing sustainable solutions for the country's problems. Dr. Talwar's participation underscored Chitkara University's commitment to promoting scientific advancements and fostering collaboration in the field of science and technology.",
        "image_url": "/assets/BlogPageImg7.png"
    },
    {
        "title": "Innovative Endeavors: DICE Technovation Project Exhibition at Chitkara University",
        "date": "2023-12-13",
        "content": "On December 13, 2023, DICE at Chitkara University, Punjab, organized a Project Exhibition titled DICE Technovation: A Step Towards Innovations at Alpha Zone, Chitkara University. The event, graced by Mr. Jogvinder Singh, M.D., and Mr. Gagan from Solitarie Infosystems Pvt. Ltd., showcased 60 projects from first-year students, attracting over 500 participants. Projects featured advanced technologies such as IoT, Li-Fi, and Machine Learning, reflecting the students' dedication to innovation. Participants presented their ideas, designs, and prototypes, fostering collaboration and knowledge exchange within the engineering community. Under the leadership of Dr. Rajneesh Talwar, the Project Exhibition celebrated innovation and provided invaluable exposure to real-world engineering challenges. The event's success underscored the talent, creativity, and collaborative spirit of the engineering community at Chitkara University.",
        "image_url": "/assets/BlogPageImg6.png"
    },
    {
        "title": "Blockbash Workshop: Unlocking the Power of Blockchain at Chitkara University",
        "date": "2023-11-23",
        "content": "In collaboration with the 3rd Year Computer Science Engineering (CSE) department, the Department of Interdisciplinary Courses in Engineering (DICE) at Chitkara University organized a two-day workshop titled Blockbash Workshop on November 23 and 24, 2023. The workshop, inaugurated by Dr. Rajneesh Talwar, Dean of DICE, and Dr. Rupali Gill, Dean of 3rd Year CSE, aimed to equip students with the fundamentals of blockchain technology. Led by Vinayak Kalra from Crewsphere ICP India Hub, the workshop provided a comprehensive introduction to blockchain technology, emphasizing its decentralized and distributed nature. Students were guided through the Motoko playground on GitHub, learning to create smart contracts and decentralized applications step by step. Upon completion of the workshop, students received certification from Crewsphere ICP India Hub, accrediting them as Level-1 Blockchain Developers. Mentors continued to support students in their blockchain projects through online interactions on platforms like Google Meet. Additionally, each participant received coupons worth Rs 1000/- to aid in their projects, with winning teams standing a chance to win up to Rs 25,000/- upon project submission. The Blockbash Workshop not only empowered students with blockchain development skills but also provided them with the resources and support needed to pursue their blockchain projects effectively.",
        "image_url": "/assets/BlogPageImg5.png"
    },
    {
        "title": "Empowering Minds: Exploring Machine Learning Workshop at Chitkara University",
        "date": "2023-11-16",
        "content": "On November 16, 2023, the Department of Interdisciplinary Courses in Engineering (DICE) at Chitkara University organized a workshop titled Exploring Machine Learning. Led by Dr. Satyajit Anand, an expert in the field, the workshop aimed to provide attendees with a comprehensive understanding of machine learning and its practical applications. Prof (Dr.) Rajneesh Talwar, Dean of DICE, commenced the event with an insightful introduction highlighting the significance of machine learning in today's technological landscape. Dr. Anand's presentation covered core machine learning concepts, types, and real-world applications across various industries. Attendees were guided through practical implementation, including dataset handling, data visualization, and model building. The workshop fostered open dialogue, encouraging participants to explore further in the field of machine learning. It was a significant step in nurturing a culture of continuous learning and innovation within the university.",
        "image_url": "/assets/BlogPageImg4.png"
    },
    {
        "title": "TechQuake 2023: A Hackathon Extravaganza at Chitkara University",
        "date": "2023-10-07",
        "content": "DICE, the student-led innovation hub at Chitkara University, sent a team of six students to participate in TechQuake 2023, a prestigious hackathon event. Over the course of two days, participants collaborated to develop innovative solutions to societal challenges. The event featured keynote speeches, presentations on Open Innovation and the United Nations' Sustainable Development Goals, and group discussions. Chitkara University's teams, Impact Catalyst and Team Innovation Invincibles, impressed judges with their projects, with Team Innovation Invincibles receiving the Award of Honour. TechQuake 2023 underscored the dedication of DICE at Chitkara University to fostering innovation and driving positive change.",
        "image_url": "/assets/BlogPageImg2.png"
    },
    {
        "title": "Exploring Machine Learning Applications Workshop at Chitkara University",
        "date": "2023-10-07",
        "content": "The Department of Interdisciplinary Courses in Engineering (DICE) at Chitkara University hosted a workshop titled Exploring Machine Learning on October 7, 2023. Led by Prof (Dr.) Rajneesh Talwar, the event highlighted the importance of machine learning in today's technology landscape. Dr. Satyajit Anand, an expert in the field, guided participants through various aspects of machine learning, including dataset handling, data visualization, and model building. The interactive session concluded with attendees feeling inspired to delve deeper into the field.",
        "image_url": "/assets/BlogPageImg1.png"
    }
]